-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 11, 2022 at 04:27 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 7.4.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `travel`
--

-- --------------------------------------------------------

--
-- Table structure for table `listtravel`
--

CREATE TABLE `listtravel` (
  `t_id` int(10) NOT NULL,
  `t_name` varchar(50) NOT NULL,
  `t_detail` text NOT NULL,
  `t_url` text NOT NULL,
  `id_type` int(10) NOT NULL,
  `province` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `listtravel`
--

INSERT INTO `listtravel` (`t_id`, `t_name`, `t_detail`, `t_url`, `id_type`, `province`) VALUES
(11, 'เกาะมุก', 'เกาะมุก ได้ชื่อว่า “ถ้ำมรกตอันล้ำค่าแห่งอันดามัน” เป็นเกาะที่ใหญ่เป็นอันดับที่ 3 ของท้องทะเลตรังเลยทีเดียว นอกจากชาดหาดที่สวยงามแล้ว เกาะมุกยังมีจุดเด่นที่ ถ้ำมรกต ถ้ำน้ำเล็กๆ ซึ่งมีความยาวประมาณ 80 เมตร นักท่องเที่ยวจะต้องลอยตัวฝ่าความมืดเพื่อเข้าไปภายในถ้ำและต้องเป็นช่วงเวลาน้ำลงเท่านั้นด้วย ภายในถ้ำน้ำทะเลจะมีสีเขียวคล้ายมรกตสวยงามอลังการ Unseen สุดๆ', 'https://cms.dmpcdn.com/travel/2017/08/03/b831d834-c87d-46d8-9b45-672dca0e8df2.jpg', 7, 'ตรัง'),
(12, 'ชิงช้าต้นไม้', ' ถ้ามีโอกาสไปเที่ยวพิษณุโลก แต่ไม่ได้ไปนั่งชิงช้าต้นไม้ ที่ บ้านสวนชมวิวภูรักไทย อ.เนินมะปราง เราบอกเลยว่าพลาดอย่างแรง!!! เพราะเป็นจุดชมวิวที่สวยที่สุดในพิษณุโลกทีเดียวค่ะ\r\n\r\n      จากจุดชมวิวบนต้นไม้นี้สามารถมองออกไปเห็นทิวเขาและพื้นที่ราบรอยต่อของ 5 จังหวัด คือ นครสวรรค์ ลพบุรี พิจิตร เพชรบูรณ์ และพิษณุโลก เวลาที่แนะนำให้มาเลยก็คือช่วงปลายฝนต้นหนาว เพราะจะได้เห็นทั้งทะเลหมอกและพระอาทิตย์ขึ้นยามเช้าเลยทีเดียว', 'https://cms.dmpcdn.com/travel/2017/08/03/33ae5382-06aa-4ff9-9bf4-eb30b328f29e.jpg', 5, 'พิษณุโลก'),
(13, 'ไร่ชาฉุยฟง', 'นอกจาก เชียงราย จะเป็นจังหวัดที่มีสถานที่ท่องเที่ยวชื่อดังอย่าง วัดร่องขุ่น, บ้านดำ, ดอยตุง แล้ว ที่นี่ยังเป็นอีกจังหวัดหนึ่งที่มีการทำไร่ชาตามแนวภูเขาค่ะ และแน่นอนว่าตรงจุดนี้เอง ทำให้เราเห็นวิวภูเขาสูงรายล้อมไร่ชาสีเขียวเป็นแนวยาว และฟ้าสีคราม\r\n\r\n     ไร่ชาฉุยฟง ตั้งอยู่ที่ อ.แม่จัน จ.เชียงราย ค่ะ เป็นแหล่งปลูกชาชั้นดี กิจกรรมอีกอย่างที่นักท่องเที่ยวชื่นชอบกันมากๆ ก็คือ การลงไปถ่ายรูปสวยๆ กับไร่ชาค่ะ นอกจากนี้ ถ้ามาตอนเช้าหน่อยๆ ก็จะได้เห็นคุณป้า คุณอา มาเก็บยอดอ่อนใบชาด้วยนะ', 'https://cms.dmpcdn.com/travel/2017/08/03/71bdbdd6-bc67-40a0-b9e5-b8155309592b.jpg', 8, 'เชียงราย'),
(14, 'เกาะตาชัย', 'เกาะตาชัย ขึ้นชื่อเรื่องหาดทรายขาวราวคอฟฟี่เมต เป็นที่เที่ยวนิยมมากๆ ในไม่กี่ปีมานี้ค่ะ เกาะตาชัยเป็นส่วนหนึ่งของอุทยานแห่งชาติหมู่เกาะสิมิลัน ทางอุทยานฯ เพิ่งเปิดให้นักท่องเที่ยวได้มีโอกาสเข้าไปยลโฉมได้ไม่นาน อีกอย่างคือเกาะตาชัยนั้นจะมีช่วงปิดเกาะให้ธรรมชาติได้ฟื้นฟูในช่วงเดียวกันกับเกาะสิมิลัน จึงทำให้ทุกครั้งที่ได้ไปเที่ยวเราจะมีโอกาสสัมผัสความงามที่สมบูรณ์แบบอยู่เสมอ', 'https://cms.dmpcdn.com/travel/2017/08/03/2db619dd-b1f6-49ac-9c0a-c56ae8a1746a.jpg', 7, 'พังงา'),
(15, 'น้ำพุร้อนฝาง', 'น้ำพุร้อนฝาง ตั้งอยู่ในอุทยานแห่งชาติดอยผ้าห่มปก ซึ่งมีความอุดมสมบูรณ์ทางธรรมชาติมาก บ่อน้ำพุร้อนมีมากกว่า 50 บ่อ กระจายไปทั่วพื้นที่ และมีขนาดใหญ่เล็กแตกต่างกันไป อุณหภูมิสูงประมาณ 90 องศาเซลเซียส มีบริการบ่อแช่น้ำแร่อาบน้ำแร่แบบส่วนตัว อุณหภูมิอุ่นพอดีช่วยให้สบายตัวและดีต่อผิวพรรณ นอกจากนี้ยังมีบ่อต้มไข่ไว้ให้อิ่มอร่อยกันอีกด้วย', 'https://cms.dmpcdn.com/travel/2017/08/03/a65826bf-aca5-4be5-8873-f39a1e78ee18.jpg', 9, 'เชียงใหม่'),
(16, 'วัดเฉลิมพระเกียรติพระจอมเกล้าราชานุสรณ์', ' อีกหนึ่ง Unseen Thailand ที่ไม่ควรพลาด วัดเฉลิมพระเกียรติพระจอมเกล้าราชานุสรณ์ หรือ วัดพระบาทปู่ผาแดง ในอำเภอแจ้ห่ม จังหวัดลำปาง วัดแห่งนี้ตั้งอยู่บนยอดเขา หรือดอยปู่ยักษ์ ในพื้นที่เขตห้ามล่าสัตว์ป่าดอยพระบาท มีรอยพระพุทธบาทประดิษฐานอยู่ และมีเจดีย์ตั้งอยู่บนยอดเขาเป็นเอกลักษณ์ที่โดดเด่น', 'https://cms.dmpcdn.com/travel/2017/08/03/bdff5372-bc3f-407c-b010-c627b0c95208.jpg', 3, 'ลำปาง'),
(17, 'เพลาเพลิน', 'หลายคนอาจจะไม่เชื่อเพราะติดภาพความแห้งแล้งของอีสานเข้าไป ก็ไว้จนคิดว่าอีสานต้องร้อนและแล้งสุดๆ แต่ขอบอกว่า เดี๋ยวนี้เขาพัฒนาแล้ว ! ใครจะไปเชื่อว่าอีสานใต้ จะมีเที่ยวชมดอกไม้เมืองหนาว แต่ก็มีอยู่จริงๆ ที่ เพลาเพลิน บุรีรัมย์ ค่ะ ที่นี่หลักๆ แล้วสร้างขึ้นเพื่อเป็นสถานที่เพื่อพัฒนาผู้เรียนนอกห้องเรียนสำหรับเยาวชน และบุคคลทั่วไป นอกจากนี้อุทยานไม้ดอกเพลาเพลินก็จะมีเรือนจัดแสดงพืชพันธุ์นานาชนิดอีกด้วย', 'https://cms.dmpcdn.com/travel/2017/08/03/777c82fa-272f-43e7-806a-8d53a582e232.jpg', 8, 'บุรีรัมย์'),
(18, 'หมู่เกาะกำ', 'หมู่เกาะกำ นั้น เป็นหมู่เกาะที่อยู่ในพื้นที่ของอุทยานแห่งชาติแหลมสน ที่นี่เป็นหมู่เกาะที่มีความสวยงาม น้ำทะเลใส และหาดทรายขาว เป็นจุดดำน้ำตื้น, เล่นน้ำ ของเหล่านักท่องเที่ยวอีกแห่งหนึ่งค่ะ ซึ่งสามารถไปเที่ยวที่นี่ได้ด้วยโปรแกรมนำเที่ยวหมู่เกาะกำแบบไปเช้าเย็นกลับ สามารถเช่าเหมาเรือหางยาวของชาวบ้าน ติดต่อขอเช่าเรือได้ที่ชมเรือนำเที่ยวค่ะ', 'https://cms.dmpcdn.com/travel/2017/08/03/2699f5f3-eefc-4b76-8dd3-8133b4873d15.jpg', 7, 'ระนอง'),
(19, 'ซากุระ อ่างขาง', 'ต้องบอกว่าหนึ่งปีมีแค่ครั้งเดียวเท่านั้นกับการอวดโฉมของซากุระญี่ปุ่น ที่ไม่ต้องบินไปไกลก็สามารถเที่ยวชมกันได้ที่ สถานีเกษตรหลวงอ่างขาง ต้นซากุระญี่ปุ่น และ เชอรี่ (Cherry Blossom) ซึ่งมูลนิธิโครงการหลวงได้นำเข้ามาปลูกทั้งจากญี่ปุ่น และไต้หวันนั้น บานสะพรั่งสีชมพูสวยไปทั้งอ่างขางกว่า 5,000 ต้นแล้วค่ะ นักท่องเที่ยวสามารถเดินชมได้ตามจุดต่างๆ ได้', 'https://cms.dmpcdn.com/travel/2017/08/03/73512677-71cf-4649-9b4d-ca4b47d2587e.jpg', 5, 'เชียงใหม่'),
(20, 'เกาะไม้ท่อน', 'Honeymoon Island หรือ เกาะไม้ท่อน เกาะส่วนตัวที่มองจากด้านบนอากาศลงมาแล้วจะเห็นเป็นรูปท่อนไม้ จึงเป็นที่มาของเกาะไม้ท่อนนั่นเอง ด้วยความที่เป็นเกาะส่วนตัวเลยทำให้นักท่องเที่ยวที่มาเที่ยวพักผ่อนที่นี่ต่อวันมีไม่มากนัก ความอุดมสมบูรณ์ของธรรมชาติเลยมีให้เห็นอย่างนี้แหละค่ะ', 'https://cms.dmpcdn.com/travel/2017/08/03/e1f47499-15d5-4946-8fde-878d500bb1f5.jpg', 4, 'ภูเก็ต'),
(21, 'พระธาตุศรีสองรัก', 'พระธาตุศรีสองรัก นั้นถือเป็นสัญลักษณ์ และตราประจำจังหวัดเลย อยู่ในวัดพระธาตุศรีสองรักซึ่งเป็นวัดที่ไม่มีพระภิกษุพำนักอยู่ สร้างขึ้นในสมัยสมเด็จพระมหาจักรพรรดิ สมัยกรุงศรีอยุธยา และพระเจ้าไชยเชษฐาธิราช กรุงศรีสัตนาคนหุต (เวียงจันทร์) ในปีพ.ศ. 2103 เพื่อเป็นสักขีพยานในการทำสัญญาทางพระราชไมตรีแสดงความสัมพันธ์อันดีต่อกันนั่นเอง', 'https://cms.dmpcdn.com/travel/2017/08/03/6a1ca211-0b46-4dd0-9350-7cdcf833a975.jpg', 3, 'เลย'),
(22, 'ไร่สตรอเบอร์รี่', 'หน้าหนาวในไทย นอกจากการไปนอนกางเต้นท์ ดูทะเลหมอก หรือ ดูดอกไม้เมืองหนาวบานสะพรั่ง อีกสิ่งหนึ่งที่พลาดไม่ได้เลยก็คือการไปชิมสตรอว์เบอร์รี่สดๆ จากไร่ และที่ ‘เชียงใหม่’ ก็เป็นจังหวัดที่มีไร่สตรอว์เบอร์รี่มากมาย ให้เราได้เลือกไปชม ชิม ช้อปกันอย่างจุใจเลยค่ะ', 'https://cms.dmpcdn.com/travel/2017/08/03/1b3472eb-6d0a-4e03-b53e-7882639f6aed.jpg', 8, 'เชียงใหม่'),
(23, 'ภูชี้ฟ้า', 'ภูชี้ฟ้า เป็นยอดเขาสูงที่สุดในเทือกเขาดอยผาหม่น ติดชายแดนไทย-ลาว ค่ะ ตั้งอยู่ในอำเภอเทิง จังหวัดเชียงราย ด้วยความมีเอกลักษณ์ทางธรรมชาติของลักษณะหน้าผาปลายยอดแหลม เป็นแนวยาวที่ชี้ไปบนฟ้าทางฝั่งประเทศลาว จึงเป็นที่มาของชื่อเรียกว่า “ภูชี้ฟ้า” นั่นเอง', 'https://cms.dmpcdn.com/travel/2017/08/03/73b05b6c-d3b6-4808-8a69-426b15b56fac.jpg', 5, 'เชียงราย'),
(24, 'วัดเขาวงพระจันทร์', 'วัดเขาวงพระจันทร์ เรียกได้ว่าเป็นอีกหนึ่งวัดที่เป็นดั่งศูนย์รวมจิตใจของชาวลพบุรีเลยก็ว่าได้ บนยอดเขาเป็นที่ประดิษฐานของรอยพระพุทธบาทแท้ (รอยพระบาทที่ 4) และยังเป็นที่พิสูจน์ศรัทธาอีกด้วย เพราะการที่จะขึ้นไปได้นั้นต้องผ่านขั้นบันไดยาวต่อเนื่องแบบไม่มีจุดสิ้นสุดกันเลยทีเดียว ด้วยจำนวนขั้นทั้งหมดถึง 3,790 ขั้นด้วยกันทีเดียว', 'https://cms.dmpcdn.com/travel/2017/08/03/cc129264-3f52-463d-94e3-3ecf82a98353.jpg', 3, 'ลพบุรี'),
(25, 'Coro Field สวนผึ้ง', 'Coro Field ที่เที่ยวรูปแบบใหม่ Lifestyle Farming สไตล์ญี่ปุ่นแห่งเดียวในประเทศไทย ไม่ได้อยู่ที่ไหนไกล ในอำเภอสวนผึ้ง จังหวัดราชบุรีนี่เอง บรรยากาศนี่เหมือนหลุดไปในประเทศญี่ปุ่นเลยทีเดียวค่ะ\r\n\r\n       อาคารกระจกใสสไตล์มินิมอลกับแปลงพืชผักสีเขียว มองไปทางไหนก็สดชื่นสบายตา ที่นี่ไม่ได้แค่ปลูกผักสวยๆ ให้เราได้ชมเท่านั้น แต่ยังเต็มไปด้วยกิจกรรมที่น่าสนใจมากมาย ให้เราได้สนุกสนานและได้เข้าถึงการเกษตรแบบใกล้ชิด', 'https://cms.dmpcdn.com/travel/2017/08/03/a4730591-ce6c-4e15-b162-f54d144ac627.jpg', 8, 'ราชบุรี'),
(26, 'เกาะหวาย', 'เกาะหวาย อยู่ห่างจากเกาะช้างเพียง 40 นาที สามารถขึ้นเรือได้ที่ท่าเรือบางเบ้าบนเกาะช้าง หรือจะขึ้นมาจากอ.แหลมงอบ (ท่าเรือกรมหลวงชุมพร) ก็ได้ ต้องบอกก่อนว่าถ้าอยากจะเห็นปะการังสีสวยๆ สดๆ จะต้องออกไปไกลจากหาดสักหน่อย ส่วนใหญ่จะเป็นปะการังเขากวาง และปะการังพุ่ม แต่จะต้องระวังหอยเม่นด้วยเพราะบริเวณนี้ค่อนข้างจะชุกชุม แต่ก็เป็นสิ่งยืนยันความสมบูรณ์ของท้องทะเลที่นี่ได้เป็นอย่างดีค่ะ', 'https://cms.dmpcdn.com/travel/2017/08/03/4f35ef7e-f800-4424-86f0-4d4cfa7b08cf.jpg', 7, 'ตราด'),
(27, 'วัดศรีชุม', 'วัดศรีชุม เป็นอีกวัดที่เป็นไฮไลท์ของเมืองมรดกโลก อุทยานประวัติศาสตร์สุโขทัยค่ะ วัดนี้เป็นที่ประดิษฐานองค์พระพุทธรูปอยู่ในมณฑปชื่อว่า “พระพุทธอจนะ” เป็นที่เลื่องลือถึงความศักดิ์สิทธิ์ และมีมนต์เสน่ห์ มีเอกลักษณ์ชวนให้นักท่องเที่ยวมาเที่ยวชม และสักการะอย่างไม่ขาดสาย และยังมีตำนานเรื่อง พระพุทธรูปพูดได้ อีกด้วย', 'https://cms.dmpcdn.com/travel/2017/08/03/d0942c30-0c4a-4bb1-9d6c-96bf98a5d043.jpg', 3, 'สุโขทัย'),
(28, 'ภูลมโล', ' ใครกำลังอยากไปชมซากุระเมืองไทย หรือ ต้นนางพญาเสือโคร่ง ดอกสีชมพู บานสะพรั่งไปทั่วทั้งขุนเขา แล้วล่ะก็ ต้องไปพลาดไปเที่ยวที่นี่ค่ะ “ภูลมโล” อ.ด่านซ้าย จ.เลย ที่นี่เป็นแหล่งท่องเที่ยวเชิงอนุรักษ์ธรรมชาติแห่งใหม่ ที่มีต้นนางพญาเสือโคร่งกว่า 100,000 ต้น ในพื้นที่รวมประมาณ 1,000 ไร่ทีเดียว และได้เปิดให้นักท่องเที่ยวเข้าชมอีกด้วย', 'https://cms.dmpcdn.com/travel/2017/08/03/58218a99-7f85-4cd8-9fa3-6f366fba7dc0.jpg', 5, 'เลย'),
(29, 'วัดสมานรัตนาราม', ' วัดสมานรัตนาราม ตั้งอยู่ระหว่างอำเภอบางคล้า และอำเภอคลองเขื่อน ริมแม่น้ำบางปะกง จังหวัดฉะเชิงเทรา ค่ะ จากกรุงเทพฯ มาไม่ไกลเพียงแค่ประมาณชั่วโมงกว่าๆ เท่านั้นเอง สำหรับที่วัดสมานรัตนารามนี้เป็นวัดที่มีสิ่งศักดิ์สิทธิ์ถึง 10 แห่งด้วยกันที่ผู้คนนิยมมาขอพร และทำบุญค่ะ', 'https://cms.dmpcdn.com/travel/2017/08/03/922917f2-16ee-4eb5-ad86-a5f61e0dc44c.jpg', 3, 'กรุงเทพมหานคร'),
(30, 'วัดพระธาตุเขาน้อย', 'สำหรับวันนี้เราจะพาไปชมวิวที่สวยที่สุดของจังหวัดน่าน พร้อมนมัสการองค์พระใหญ่คู่บ้านคู่เมืองน่าน ที่ “วัดพระธาตุเขาน้อย” วัดพระธาตุเขาน้อยตั้งอยู่ใน ตำบลไชยสถาน องค์พระธาตุตั้งอยู่บนยอดดอยเขาน้อยซึ่งอยู่ด้านตะวันตกของตัวเมืองน่านซึ่งสูงจากระดับน้ำทะเลประมาณ 240 ม. ค่ะ สันนิษฐานว่ามีอายุรุ่นราวคราวเดียวกับพระธาตุแช่แห้ง ที่นี่เป็นจุดชมวิวเมืองน่านที่สวยงามแบบ 360 องศา', 'https://cms.dmpcdn.com/travel/2017/08/03/5ec6258d-0c7d-4367-bb8e-46b3ef8d6dcb.jpg', 5, 'น่าน');

-- --------------------------------------------------------

--
-- Table structure for table `type`
--

CREATE TABLE `type` (
  `id_type` int(10) NOT NULL,
  `type_name` varchar(50) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `type`
--

INSERT INTO `type` (`id_type`, `type_name`) VALUES
(3, 'วัด'),
(4, 'ทะเล'),
(5, 'ภูเขา'),
(7, 'เกาะ'),
(8, 'บ้านไร่'),
(9, 'น้ำตก');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `listtravel`
--
ALTER TABLE `listtravel`
  ADD PRIMARY KEY (`t_id`),
  ADD KEY `id_type` (`id_type`);

--
-- Indexes for table `type`
--
ALTER TABLE `type`
  ADD PRIMARY KEY (`id_type`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `listtravel`
--
ALTER TABLE `listtravel`
  MODIFY `t_id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=31;

--
-- AUTO_INCREMENT for table `type`
--
ALTER TABLE `type`
  MODIFY `id_type` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `listtravel`
--
ALTER TABLE `listtravel`
  ADD CONSTRAINT `listtravel_ibfk_1` FOREIGN KEY (`id_type`) REFERENCES `type` (`id_type`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
